//****************************************************************************//
// システム         : PM.NS
// プログラム名称   : タブレット設定マスタアップロード処理抽出条件クラス
// プログラム概要   : タブレット設定マスタアップロード処理抽出条件クラス
//----------------------------------------------------------------------------//
//                (c)Copyright  2013 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
//----------------------------------------------------------------------------//
// 管理番号  10902622-01 作成担当 : 鄭慕鈞
// 作 成 日  2013/05/29  修正内容 : 新規作成
//----------------------------------------------------------------------------//
using System;

namespace Broadleaf.Application.UIData
{
    /// <summary>
    /// タブレット設定マスタアップロード
    /// </summary>
    public class TabSCMUpLoadCondtion
    {
    }
}
