//**********************************************************************//
// System           :   ＭＡ．ＮＳ　                                    //
// Sub System       :                                                   //
// Program name     :   商品アクセスクラス                              //
//                  :   MAKHN04112A.DLL                                 //
// Name Space       :   Broadleaf.Application.Controller                //
// Programmer       :   Y.Sasaki                                        //
// Date             :   2007.1.10                                       //
//----------------------------------------------------------------------//
// Update Note      :   2007.08.30 對馬 大輔                            //
//                  :   ・DC.NS対応                                     //
//----------------------------------------------------------------------//
// Update Note      :   2008.06.12 對馬 大輔                            //
//                  :   ・PM.NS対応                                     //
//----------------------------------------------------------------------//
// Update Note      :   2009/11/13 李占川                               //
//                  :   TBO検索ボタンからTBO検索のメソッド追加          //
//----------------------------------------------------------------------//
// Update Note      :   2010/06/08 楊明俊                               //
//                  :   BLコード入力時の品名取得処理変更                //
//----------------------------------------------------------------------//
// Update Note      :   2012.04.12 30182 立谷亮介		                //
//                  :   PM-SCM連携 自動回答処理 高速化対応              //
//----------------------------------------------------------------------//
// Update Note      :   2012/12/06 田建委　　　　		                //
//                  :   2013/01/16配信分　Redmine#33663の#4の対応　     //
//----------------------------------------------------------------------//
// Update Note      :   2012/12/01 zhangy3    		                    //
//                  :   2013/01/16配信分 Redmine#33231商品在庫マスタの仕様変更//
//----------------------------------------------------------------------//
// Update Note      :   2013/02/08 田建委 2013/03/26配信分             //
//                      Redmine#34640 商品在庫マスタの仕様変更(#33231の残留分)//
//----------------------------------------------------------------------//
// Update Note      :   2013/02/27 zhujc 2013/03/13配信分               //
//                      Redmine#34858 在庫仕入入力　　　　　　　　　　　//
//----------------------------------------------------------------------//
// Update Note      :   K2013/03/18 田建委 2013/04/10配信分             //
//                      Redmine#35071 商品在庫マスタ・山形部品様個別組み込み（#34640残留）//
//----------------------------------------------------------------------//
// Update Note      :   2013/04/15  donggy                              //
// 管理番号         :   10801804-00 2013/05/15配信分の対応              //
//----------------------------------------------------------------------//
// Update Note      :   2013/05/24 donggy　2013/06/18配信分         　　//
//                  :   10801804-00  Redmine#35874の対応　　　　　　　　//
//----------------------------------------------------------------------//
// Update Note      :   2013/08/13 田建委                           　　//
//                  :   Redmine#39794 商品在庫マスタⅡの速度改善　　　　//
//----------------------------------------------------------------------//
// Update Note      :   2014/01/15 huangt                           　　//
//                  :   Redmine#40998 貸出数の変更を可能にするように修正//
//----------------------------------------------------------------------//
// Update Note      :   2014/02/10 高陽                           　  　//
//                  :   Redmine#41976 商品マスタⅡの追加                //
//----------------------------------------------------------------------//
// Update Note      :   2015/08/17 田建委                               //
//                  :   Redmine#47036 商品在庫一括登録修正 管理拠点・倉庫の追加//
//----------------------------------------------------------------------//
// Update Date      :   2018/04/05 30757 佐々木　貴英                   //
//                  :   NS3Ai対応（BL統一部品コード対応）          　　 //
//----------------------------------------------------------------------//
//                Copyright(c)2018 Broadleaf Co.,Ltd.                   //
//**********************************************************************//
using System.Reflection;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;

using Broadleaf.Library;

// アセンブリに関する一般情報は以下の属性セットをとおして制御されます。 
// アセンブリに関連付けられている情報を変更するには、
// これらの属性値を変更してください。
[assembly: AssemblyTitle("MAKHN04112A")]
[assembly: AssemblyDescription("")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("Broadleaf Co.,Ltd.")]
[assembly: AssemblyProduct("Partsman")]
[assembly: AssemblyCopyright("(c)2018 Broadleaf Co.,Ltd.")]
[assembly: AssemblyTrademark("Partsman")]
[assembly: AssemblyCulture("")]
[assembly: AssemblyDeployment(DeployPosition.Client)]

// ComVisible を false に設定すると、このアセンブリ内の型は COM コンポーネントには 
// 参照不可能になります。COM からこのアセンブリ内の型にアクセスする場合は、 
// その型の ComVisible 属性を true に設定してください。
[assembly: ComVisible(false)]

// 次の GUID は、このプロジェクトが COM に公開される場合の、typelib の ID です
[assembly: Guid("3691867f-fc35-43bc-b10f-f71df03e3662")]

// アセンブリのバージョン情報は、以下の 4 つの値で構成されています:
//
//      Major Version
//      Minor Version 
//      Build Number
//      Revision
//
// すべての値を指定するか、下のように '*' を使ってリビジョンおよびビルド番号を 
// 既定値にすることができます:
[assembly: AssemblyVersion("8.10.1.0")]
[assembly: AssemblyFileVersion("8.10.1.0")]
