//***********************************************************************//
// System			:	DC.NS											 //
// Sub System		:													 //
// Program name		:	仕入日報月報									 //
//					:	DCTOK02012P_01A4C.DLL							 //
// Name Space		:	Broadleaf.Application.UIData					 //
// Programmer		:	96186 立花 裕輔									 //
// Date				:	2007.xx.xx										 //
//-----------------------------------------------------------------------//
// Update Note      :   2008.08.11 30413 犬飼                            //
//   		        :	PM.NS対応									     //
//-----------------------------------------------------------------------//
// Update Note      :   2012/04/16 許培珠　　                            //
//   		        :	10801804-00　05/24配信分	redmine#29135        //
//                  :   売上・粗利目標、進捗率・達成率の印字について     //
//-----------------------------------------------------------------------//
// Update Note      :   2012/05/22 李亜博　　                            //
//   		        :	10801804-00  06/27配信分    redmine#29908        //
//                      売上日報月報 粗利率の不正表示                    //
//-----------------------------------------------------------------------//
// Update Note      :   2012/05/22 李亜博　　                            //
//   		        :	10801804-00  06/27配信分    Redmine#29898        //
//                      売上日報月報 進捗率算出時に営業日を参照していない//
//                      パターンが存在する                               //
//-----------------------------------------------------------------------//
// Update Note      :   2012/06/07 李亜博　　                            //
//   		        :	10801804-00  06/27配信分    Redmine#30314        //
//                      売上日報月報　進捗率の印字が不正                 //
//-----------------------------------------------------------------------//
// UpdateNote       :   2012/12/28 zhuhh                                 //
// 管理番号         :   10806793-00 2013/03/13配信分                     //
//                  :   redmine #34098 罫線印字制御を追加する            //
//-----------------------------------------------------------------------//
// UpdateNote       :   2013/02/23 王君                                  //
// 管理番号         :   10806793-00 2013/03/13配信分                     //
//                  :   redmine #34098 罫線印字制御を追加する            //
//-----------------------------------------------------------------------//
// UpdateNote       :   2013/02/25 zhlj                                  //
// 管理番号         :   10900690-00 2013/3/13配信分の緊急対応            //
//                  :   redmine #34586 三和部品　売上日報月報（受注者別）//
//-----------------------------------------------------------------------//
// UpdateNote       :   2014/12/04 周洋                                  //
//                  :   redmine #43991 仕掛一覧№2591の対応              //
//-----------------------------------------------------------------------//
// UpdateNote       :   2014/12/09 周洋                                  //
// Programmer       :   redmine #43991の#43の対応                        //
//-----------------------------------------------------------------------//
// UpdateNote       :   2014/12/18 周洋                                  //
// Programmer       :   redmine #43991の#51の対応                        //
//-----------------------------------------------------------------------//
//                 Copyright(c)2007 Broadleaf Co.,Ltd.                   //
//***********************************************************************//
using System.Reflection;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;
using Broadleaf.Library;

// アセンブリに関する一般情報は以下の属性セットをとおして制御されます。 
// アセンブリに関連付けられている情報を変更するには、
// これらの属性値を変更してください。
[assembly: AssemblyTitle("DCTOK02012P_01A4C")]
[assembly: AssemblyDescription("")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("Broadleaf Co.,Ltd.")]
[assembly: AssemblyProduct("Partsman")]
[assembly: AssemblyCopyright("(c)2008 Broadleaf Co.,Ltd.")]
[assembly: AssemblyTrademark("Partsman")]
[assembly: AssemblyCulture("")]
[assembly: AssemblyDeployment(DeployPosition.Client)]

// ComVisible を false に設定すると、このアセンブリ内の型は COM コンポーネントには 
// 参照不可能になります。COM からこのアセンブリ内の型にアクセスする場合は、 
// その型の ComVisible 属性を true に設定してください。
[assembly: ComVisible(false)]

// 次の GUID は、このプロジェクトが COM に公開される場合の、typelib の ID です
[assembly: Guid("70d70f83-6ce9-4bff-9442-f80faf0ad06e")]

// アセンブリのバージョン情報は、以下の 4 つの値で構成されています:
//
//      Major Version
//      Minor Version 
//      Build Number
//      Revision
//
// すべての値を指定するか、下のように '*' を使ってリビジョンおよびビルド番号を 
// 既定値にすることができます:
[assembly: AssemblyVersion("8.10.1.0")]
[assembly: AssemblyFileVersion("8.10.1.0")]
