//**********************************************************************//
// System           :   ＭＡ．ＮＳ　                                    //
// Sub System       :                                                   //
// Program name     :   商品フォームクラス                              //
//                  :   MAKHN009380U.DLL                                //
// Name Space       :   Broadleaf.Application.Controller                //
// Programmer       :   Y.Sasaki                                        //
// Date             :   2007.1.10                                       //
//----------------------------------------------------------------------//
// Update Note      :   2007.08.30 對馬 大輔                            //
//                  :   ・DC.NS対応                                     //
//----------------------------------------------------------------------//
// Update Note      :   2008.06.12 對馬 大輔                            //
//                  :   ・PM.NS対応                                     //
//----------------------------------------------------------------------//
// Update Note      :   2010/06/08 楊明俊                               //
//                  :   改良対応                                        //
//----------------------------------------------------------------------//
// Update Note      :   2011/08/02 caohh                                //
//                  :   NSユーザー改良要望一覧連番265の対応             //
//----------------------------------------------------------------------//
// Update Note      :   2011/09/06 鄧潘ハン                             //
//                  :   NSユーザー改良要望一覧連番265の対応             //
//----------------------------------------------------------------------//
// Update Note      :   2012/11/21 zhuhh  redmine #33230                //
//                      掛率設定マスタ内に論理削除レコードが存在する    //
//                      状態で、同商品の掛率の登録をしようとしている    //
//                      ために発生している不具合の対応                  //
//----------------------------------------------------------------------//
// Update Note      :   2012/12/01 zhangy3  2013/01/16配信分            //
//                      Redmine #33231  商品在庫マスタの仕様変更　　　　//
//----------------------------------------------------------------------//
// Update Note      :   2013/02/08 田建委 2013/03/26配信分             //
//                      Redmine#34640 商品在庫マスタの仕様変更(#33231の残留分)//
//----------------------------------------------------------------------//
// Update Note      :   2013/03/11 田建委 2013/03/26配信分             //
//                      Redmine#34640 商品在庫マスタの仕様変更(#33231の残留分)//
//----------------------------------------------------------------------//
// Update Note      :   K2013/03/18 田建委 2013/04/10配信分             //
//                      Redmine#35071 商品在庫マスタ・山形部品様個別組み込み（#34640残留）//
//----------------------------------------------------------------------//
// Update Note      :   2013/03/19 田建委 2013/04/10配信分             //
//                      Redmine#34640 商品在庫マスタの仕様変更(#33231の残留分)//
//----------------------------------------------------------------------//
// Update Note      :   2013/04/01 田建委 2013/04/10配信分             //
//                      Redmine#34640 商品在庫マスタの仕様変更(#33231の残留分)//
//----------------------------------------------------------------------//
// Update Note      :   2013/04/05 田建委 2013/04/10配信分             //
//                      Redmine#34640 商品在庫マスタの仕様変更(#33231の残留分)//
//----------------------------------------------------------------------//
// Update Note      :   2013/04/08 田建委 2013/04/10配信分             //
//                      Redmine#34640 商品在庫マスタの仕様変更(#33231の残留分)//
//----------------------------------------------------------------------//
// Update Note      :   2013/04/09 田建委 2013/04/10配信分             //
//                      Redmine#34640 商品在庫マスタの仕様変更(#33231の残留分)//
//----------------------------------------------------------------------//
// Update Note      :   2013/04/10 田建委 2013/04/10配信分             //
//                      Redmine#34640 商品在庫マスタの仕様変更(#33231の残留分)//
//----------------------------------------------------------------------//
// Update Note      :   2013/04/11 田建委 2013/04/10配信分             //
//                      Redmine#34640 商品在庫マスタの仕様変更(#33231の残留分)//
//----------------------------------------------------------------------//
// Update Note      :   2013/05/24 donggy　2013/06/18配信分         　　//
//                  :   10801804-00  Redmine#35874の対応　　　　　　　　//                    　
//----------------------------------------------------------------------//
// Update Note      :   2013/05/24 王君　　2013/06/18配信分         　　//
//                  :   10901273-00  Redmine#35434の対応　　　　　　　　//                    　
//----------------------------------------------------------------------//
// Update Note      :   2013/08/13 田建委                           　　//
//                  :   Redmine#39794 商品在庫マスタⅡの速度改善　　　　//
//----------------------------------------------------------------------//
// Update Note      :   2015/09/07 黄興貴                           　　//
//                  :   Redmine#47026 商品在庫マスタⅡの障害対応  　　　//
//----------------------------------------------------------------------//
// Update Note      :   2015/09/10 黄興貴                           　　//
//                  :   Redmine#47026 商品在庫マスタⅡの障害対応  　　　//
//----------------------------------------------------------------------//
// Update Note      :   2015/09/15 黄興貴                           　　//
//                  :   Redmine#47026 商品在庫マスタⅡの障害対応  　　　//
//----------------------------------------------------------------------//
// Update Note      :   2018/10/26 陳艶丹                           　　//
//                  :   Redmine#49732 原価UP率と粗利確保率の設定が消える対応//
//----------------------------------------------------------------------//
//                Copyright(c)2008 Broadleaf Co.,Ltd.                   //
//**********************************************************************//
using System.Reflection;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;

using Broadleaf.Library;

// アセンブリに関する一般情報は以下の属性セットをとおして制御されます。 
// アセンブリに関連付けられている情報を変更するには、
// これらの属性値を変更してください。
[assembly: AssemblyTitle("PMKHN09380U")]
[assembly: AssemblyDescription("")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("Broadleaf Co.,Ltd.")]
[assembly: AssemblyProduct("Partsman")]
[assembly: AssemblyCopyright("(c)2008 Broadleaf Co.,Ltd.")]
[assembly: AssemblyTrademark("Partsman")]
[assembly: AssemblyCulture("")]
[assembly: AssemblyDeployment(DeployPosition.Client)]

// ComVisible を false に設定すると、このアセンブリ内の型は COM コンポーネントには 
// 参照不可能になります。COM からこのアセンブリ内の型にアクセスする場合は、 
// その型の ComVisible 属性を true に設定してください。
[assembly: ComVisible(false)]

// 次の GUID は、このプロジェクトが COM に公開される場合の、typelib の ID です
[assembly: Guid("4f76c688-43c6-45c7-9f7d-a8408b4b05f5")]

// アセンブリのバージョン情報は、以下の 4 つの値で構成されています:
//
//      Major Version
//      Minor Version 
//      Build Number
//      Revision
//
[assembly: AssemblyVersion("8.10.1.0")]
[assembly: AssemblyFileVersion("8.10.1.0")]
