//**********************************************************************//
// System			:	Partsman    									//
// Program name		:	支払い入力画面									//
//					:	SFSIR02102U.DLL									//
// Name Space		:	Broadleaf.Windows.Forms							//
// Programmer		:	寺坂　誉志										//
// Date				:	2006.05.20										//
//----------------------------------------------------------------------//
// Update Note		:	2006.12.22  木村 武正							//
//						携帯.NS用に変更									//
//----------------------------------------------------------------------//
// Update Note		:	2008/07/08  忍 幸史 							//
//						Partsman用に変更								//
//----------------------------------------------------------------------//
// Update Note		:	2009/12/20 譚洪 ＰＭ．ＮＳ保守依頼④			//
//          		:	操作性/入力速度向上のために以下の改良を行う		//
//          		:	メニューボタンの有効／無効の設定の対応   		//
//          		:	金額入力時のｶｰｿﾙ遷移が遅いのを修正       		//
//          		:	支払内訳のスクロールを無くし、入力可能な金種は	//
//                      全て一度に確認できるように修正                  //
//          		:	伝票登録後に支払一覧を更新しないように変更 		//
//          		:	仕入先入力後に入金一覧を初期表示しないように変更//
//          		:	支払先変更時等の入力済みチェックの対象を金額項目//
//                      のみに変更                                      //
//----------------------------------------------------------------------//
// Update Note      :   2010/12/20 徐佳
//                  :   支払伝票入力の修正                              //
//----------------------------------------------------------------------//
// Update Note      :   2011/02/09 曹文傑
//                  :   RedMine #18847                                  //
//----------------------------------------------------------------------//
// Update Note      :   2012/05/10 yangmj                               //
//                  :   売上締次集計処理中に伝票発行不可の修正          //
//----------------------------------------------------------------------//
// Update Note      :   2012/12/24 王君                                 //
//                  :   10806793-00 2013/03/13配信分 Redmine#33741の対応//
//----------------------------------------------------------------------//
// Update Note      :   2013/01/10 zhuhh                                //
// 管理番号         :   10806793-00　2013/03/13配信分                   //
//                  :   Redmine #34123 手形データ重複した伝票番号の登録 //
//                                     を出来る様にする                 //
//----------------------------------------------------------------------//
// Update Note      :   2013/02/06 王君                                 //
//                  :   10806793-00 2013/03/13配信分 Redmine#33741の対応//
//----------------------------------------------------------------------//
// Update Note      :   2013/02/07 王君                                 //
//                  :   10806793-00 2013/03/13配信分 Redmine#33741の対応//
//----------------------------------------------------------------------//
// Update Note      :   2013/02/19 王君                                 //
//                  :   10806793-00 2013/03/13配信分 Redmine#33741の対応//
//----------------------------------------------------------------------//
// Update Note      :   2013/02/23 王君                                 //
//                  :   10806793-00 2013/03/13配信分 Redmine#33741の対応//
//----------------------------------------------------------------------//
// Update Note      :   2013/03/01 王君                                 //
//                  :   10806793-00 2013/03/13配信分 Redmine#33741の対応//
//----------------------------------------------------------------------//
// Update Note      :   2013/03/01 王君                                 //
//                  :   10901273-00 2013/05/15配信分 Redmine#35247の対応 仕入総括オプションの調査//
//----------------------------------------------------------------------//
//					Copyright(c)2008 Broadleaf Co.,Ltd.                 //	
//**********************************************************************//
using System.Reflection;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;
using Broadleaf.Library;

// アセンブリに関する一般情報は以下の属性セットをとおして制御されます。 
// アセンブリに関連付けられている情報を変更するには、
// これらの属性値を変更してください。
[assembly: AssemblyTitle("SFSIR02102U")]
[assembly: AssemblyDescription("")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("Broadleaf Co.,Ltd.")]
[assembly: AssemblyProduct("Partsman")]
[assembly: AssemblyCopyright("(c)2008 Broadleaf Co.,Ltd.")]
[assembly: AssemblyTrademark("Partsman")]
[assembly: AssemblyCulture("")]
[assembly: AssemblyDeployment(DeployPosition.Client)]

// ComVisible を false に設定すると、このアセンブリ内の型は COM コンポーネントには 
// 参照不可能になります。COM からこのアセンブリ内の型にアクセスする場合は、 
// その型の ComVisible 属性を true に設定してください。
[assembly: ComVisible(false)]

// 次の GUID は、このプロジェクトが COM に公開される場合の、typelib の ID です
[assembly: Guid("e1f0d2b0-8ac4-41e1-b73a-38ca1e8ec3b8")]

// アセンブリのバージョン情報は、以下の 4 つの値で構成されています:
//
//      Major Version
//      Minor Version 
//      Build Number
//      Revision
//
[assembly: AssemblyVersion("8.10.1.0")]
[assembly: AssemblyFileVersion("8.10.1.0")]

