//****************************************************************************//
// システム         : 回答送信処理
// プログラム名称   : 回答送信処理アクセス
// プログラム概要   : 
//----------------------------------------------------------------------------//
//                (c)Copyright  2009 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
//----------------------------------------------------------------------------//
// 管理番号              作成担当 : 工藤 恵優
// 作 成 日  2009/05/20  修正内容 : 新規作成
//----------------------------------------------------------------------------//
using System;

namespace Broadleaf.Application.Controller.Util
{
    /// <summary>
    /// 結果ユーティリティ
    /// </summary>
    public static class ResultUtil
    {
        /// <summary>
        /// 結果コード列挙型
        /// </summary>
        public enum ResultCode : int
        {
            /// <summary>正常</summary>
            Normal = 0,
            /// <summary>件数0</summary>
            NotFound = 4,
            /// <summary>中断</summary>
            Abort = 99,
            /// <summary>DBエラー</summary>
            DBError = 1000,
            /// <summary>エラー</summary>
            Error = -1
        }
    }
}
