//****************************************************************************//
// システム         : 自働回答処理
// プログラム名称   : 自働回答処理アクセス
// プログラム概要   : 
//----------------------------------------------------------------------------//
//                (c)Copyright  2009 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
//----------------------------------------------------------------------------//
// 管理番号              作成担当 : 工藤 恵優
// 作 成 日  2009/07/29  修正内容 : 新規作成
//----------------------------------------------------------------------------//
using System;

using Broadleaf.Application.UIData;

namespace Broadleaf.Application.Controller.Util
{
    /// <summary>
    /// Null商品連結データクラス
    /// </summary>
    /// <remarks>
    /// 品番検索にて0件だった場合に使用しています。
    /// </remarks>
    public sealed class NullGoodsUnitData : GoodsUnitData
    {
        /// <summary>
        /// デフォルトコンストラクタ
        /// </summary>
        public NullGoodsUnitData() : base() { }
    }
}
