//****************************************************************************//
// システム         : タブレット設定マスタアップロード
// プログラム名称   : タブレット設定マスタアップロードアクセス
// プログラム概要   : 
//----------------------------------------------------------------------------//
//                (c)Copyright  2013 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
//----------------------------------------------------------------------------//
// 管理番号  10902622-01 作成担当 : 鄭慕鈞
// 作 成 日  2013/05/29  修正内容 : 新規作成
//----------------------------------------------------------------------------//
// 管理番号  10902622-01 作成担当 : 鄭慕鈞
// 作 成 日  2013/06/26  修正内容 : Redmine#37337 排他制御マスタ更新タイミング
//----------------------------------------------------------------------------//
// 管理番号  10902622-01 作成担当 : 鄭慕鈞 
// 作 成 日  2013/06/27  修正内容 : Redmine#37448 全体設定マスタ(拠点別)が正常に更新されません
//----------------------------------------------------------------------------//
// 管理番号  10902622-01 作成担当 : 鄭慕鈞 
// 作 成 日  2013/06/27  修正内容 : Redmine#37451 アップロード失敗時の排他制御マスタの更新
//----------------------------------------------------------------------------//
using System.Reflection;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;

// アセンブリに関する一般情報は以下の属性セットをとおして制御されます。 
// アセンブリに関連付けられている情報を変更するには、
// これらの属性値を変更してください。
[assembly: AssemblyTitle("PMTAB00112A")]
[assembly: AssemblyDescription("")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("Broadleaf Co.,Ltd.")]
[assembly: AssemblyProduct("Partsman")]
[assembly: AssemblyCopyright("(c)2013 Broadleaf Co.,Ltd.")]
[assembly: AssemblyTrademark("Partsman")]
[assembly: AssemblyCulture("")]

// ComVisible を false に設定すると、このアセンブリ内の型は COM コンポーネントには 
// 参照不可能になります。COM からこのアセンブリ内の型にアクセスする場合は、 
// その型の ComVisible 属性を true に設定してください。
[assembly: ComVisible(false)]

// 次の GUID は、このプロジェクトが COM に公開される場合の、typelib の ID です
[assembly: Guid("ee0924fe-ae01-4901-b9fd-d60e5ccea273")]

// アセンブリのバージョン情報は、以下の 4 つの値で構成されています:
//
//      Major Version
//      Minor Version 
//      Build Number
//      Revision
//
[assembly: AssemblyVersion("8.10.1.0")]
[assembly: AssemblyFileVersion("8.10.1.0")]
